In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

In [4]:
transcations = pd.read_csv(r'D:\Customer Spend Risk Analysis\Data\Bronze\customers__bronze.csv')
customers = pd.read_csv(r'D:\Customer Spend Risk Analysis\Data\Bronze\merchants_Bronze.csv')
products = pd.read_csv(r'D:\Customer Spend Risk Analysis\Data\Bronze\transactions_bronze.csv')

In [5]:
# BASIC PROFILING IN BRONZE DATASETS

print('Transaction shape:', transcations.shape)
print('Customer shape:', customers.shape)
print('Product shape:', products.shape)

Transaction shape: (120, 6)
Customer shape: (7, 3)
Product shape: (500, 8)

In [11]:
 transcations.head()

  customer_id        name   age  annual_income  segment      city
0        C001  Customer_1  58.0            NaN      VIP     Delhi
1        C002  Customer_2  32.0            NaN  PREMIUM       NaN
2        C003  Customer_3   NaN        1084834  Premium    Mumbai
3        C004  Customer_4  31.0            NaN  Premium       NaN
4        C005  Customer_5   NaN  not available  Regular  New York

In [12]:
 customers.head()

   merchant   category  risk_score
0    Amazon        NaN        0.12
1  Flipkart        NaN        0.57
2   Walmart  Ecommerce        0.17
3    Myntra        NaN        0.21
4    Swiggy        NaN        0.25

In [13]:

 products.head()

,txn_id,txn_date,customer_id,amount,currency,merchant,city,device
0,TXN0001,22-01-2024,C036,NaN,INR,Unknown,Mumbai,NaN
1,TXN0002,2024/01/02,C070,NaN,usd,Zomato,Mumbai,Mobile
2,TXN0003,2024-02-18,C032,47261.0,usd,Flipkart,Delhi,NaN
3,TXN0004,2024-02-12,C073,NaN,INR,Unknown,Bangalore,Desktop
4,TXN0005,2024/02/08,C096,183313.0,usd,Walmart,Mumbai,NaN